////
////  Descriptions.swift
////  FirstMapKitApp
////
////  Created by Raul Shafigin on 23.05.2022.
////
//
//import Foundation
//
//enum Descriptions: CustomStringConvertible {
//    case amberMuseim
//    case cathedral
//    case highLake
//    case oceanMuseum
//    case southPark
//
//    var description: String {
//        switch self {
//
//        case .amberMuseim:
//            return  """
//Единственный в России Музей янтаря был открыт в 1979 году. Он расположен в центре Калининграда на берегу озера Верхнее в крепостной башне середины ХIХ века.
//
//Башня была построена в 1853 году под руководством разработчика общего плана крепостных сооружений Кёнигсберга шефа инженерного корпуса Эрнста Людвига фон Астера и входила в систему городских оборонительных укреплений. Она носила имя прусского генерал-фельдмаршала Фридриха Карла Дона, участника освободительной войны против наполеоновского нашествия. Здание является также памятником Второй мировой войны.
//
//Музей янтаря – это музей одного минерала. Экспозиция расположена на трех этажах здания общей площадью около 1000 кв. метров. По содержанию она делится на естественно-научную и культурно-историческую части.
//"""
//        case .cathedral:
//           return """
//Главное культурное и историческое место Калининграда. Здесь похоронен Иммануил Кант. Здесь можно погрузиться в историю, услышать один из лучших органов России и Европы. Здесь происходят события, ради которых стоит приехать в этот город.
//
//Кафедральный собор сегодня — это многофункциональный культурный центр, состоящий из академического концертного зала, где находится самый большой в России уникальный органный комплекс, и музея имени И. Канта. Вокруг собора на острове Канта располагается Парк скульптур. Расположение в самом сердце Кёнигсберга-Калининграда, на уничтоженном английской авиацией в 1944 году острове Кнайпхоф, а также мемориальное захоронение Иммануила Канта у северной стены и драматическая история разрушения и возрождения сделали Кафедральный собор символом города, его архитектурной доминантой и главным местом притяжения для всех, кто приезжает в Калининград.
//
//В собрание музея имени И. Канта входят разнообразные экспонаты, связанные с историей Кёнигсберга-Калининграда, с жизнью и научной деятельностью великого немецкого философа.
//"""
//        case .highLake:
//            return """
//Верхнее озеро на самом деле имеет искусственное происхождение и является прудом. Его создали в 1270 году. Случилось это когда рыцари Тевтонского ордена запрудили одну из приток Преголи. Полученный в результате пруд использовали для разведения рыбы. До 1949 года Верхний пруд назывался Обертайх.
//
//Пруд имеет продолговатую форму. Без учета заливов, которые расположены в северной его части, длина пруда составляет почти километр. Ширина его варьируется от 100 до почти 400 м. Пруд занимает территорию общей площадью свыше 40 га. В него впадают два ручья – Голубой и Молодёжный, а вытекает один Парковый ручей, который является притоком реки Преголя. Сразу же возле Верхнего озера находятся башни Дона и Врангеля, а также парк «Юность» и красивый район вилл Марауненхоф.
//
//Из всех достопримечательностей Калининграда Верхний пруд является особенным. Дело в его возрасте: он является вторым по старости рукотворным сооружением, которое сохранилось до наших дней. Рекордсменом является Нижний пруд, который был создан в 1256 году.
//
//До начала ХХ века пруд находился фактически за чертой города. Со временем часть оборонительных сооружений, утративших свои функции, была снесена, и город стал расти в размерах. Так в его пределах оказался и Верхний пруд, или, как его называют, Верхнее озеро.
//"""
//        case .oceanMuseum:
//            return "oceanMuseum"
//        case .southPark:
//            return "southPark"
//        }
//    }
//}
